# Pandas Library Practice

HR schema data is using and the data loaded from the SQL server.

In [154]:
import pyodbc as odbc
import pandas as pd

In [155]:
#Database connection string
conn = odbc.connect(
    "Driver={SQL Server Native Client 11.0};"
    "Server=Renuka;"
    "Database=Practice;"
    "Trusted_Connection=yes;"
)

In [166]:
#Assign the SQL query to a variable
sql= "select a.employee_id,a.salary,b.department_name,c.city,c.state_province,c.country_id from employees a \
inner join departments b \
on a.department_id = b.department_id \
inner join locations c on b.location_id = c.location_id "#inner join regions d on c.region_id = b.region_id"

#Read the SQL to a Pandas dataframe
df = pd.read_sql(sql, conn)

In [167]:
#change the datatype
df[['employee_id','salary']] = df[['employee_id','salary']].astype(int)

In [168]:
print(df)

     employee_id  salary department_name     city state_province country_id
0            200    4400  Administration  Seattle     Washington         US
1            201   13000       Marketing  Toronto        Ontario         CA
2            202    6000       Marketing  Toronto        Ontario         CA
3            114   11000      Purchasing  Seattle     Washington         US
4            115    3100      Purchasing  Seattle     Washington         US
..           ...     ...             ...      ...            ...        ...
101          111    7700         Finance  Seattle     Washington         US
102          112    7800         Finance  Seattle     Washington         US
103          113    6900         Finance  Seattle     Washington         US
104          205   12000      Accounting  Seattle     Washington         US
105          206    8300      Accounting  Seattle     Washington         US

[106 rows x 6 columns]

In [180]:
# sorting dataframe with descending order and display the null values at first 
df.sort_values("employee_id", inplace = True,ascending=False,na_position='first')

In [181]:
df.head()

     employee_id  salary   department_name     city state_province country_id
105          206    8300        Accounting  Seattle     Washington         US
104          205   12000        Accounting  Seattle     Washington         US
60           204   10000  Public Relations   Munich        Bavaria         DE
9            203    6500   Human Resources   London           None         UK
2            202    6000         Marketing  Toronto        Ontario         CA

In [182]:
#group_by function using pandas
gp_by_country = df.groupby('country_id').count()[['employee_id']]

In [183]:
print(gp_by_country)

            employee_id
country_id
CA                    2
DE                    1
UK                   35
US                   68

In [184]:
#group_by function using pandas multiple variables
gp_by_cntry_state_city = df.groupby(['country_id','state_province','city']).count()[['employee_id']]

In [185]:
print(gp_by_cntry_state_city)
#sum is to check the grouped values are correct on not
total = 'Total Number of employees : ' + str(gp_by_cntry_state_city.sum())
print(total)

                                               employee_id
country_id state_province city
CA         Ontario        Toronto                        2
DE         Bavaria        Munich                         1
UK         Oxford         Oxford                        34
US         California     South San Francisco           45
           Texas          Southlake                      5
           Washington     Seattle                       18
Total Number of employees : employee_id    105
dtype: int64

In [187]:
#filtering the data from the dataframe
#df.loc[(df['country_id'] == 'US') & (df['city']=='Seattle') & (df['employee_id'] .isin([114,123,111]))]
df.loc[(df['city']=='Munich')]
#null value condition None is nothing but null in python 
df.loc[(df['state_province'].isnull())]

   employee_id  salary  department_name    city state_province country_id
9          203    6500  Human Resources  London           None         UK